README.md
This is a collection of tips on how to avoid using products from big tech companies residing in areas without a properly functioning democracy.
<a id="org3a42c4e"></a>


# Table of Contents

1.  [Don't throw out your old computer just yet!](#org4182507)
2.  [Replace Microsoft Office with LibreOffice](#orgde35f09)
3.  [Other Resources](#orgfafb7a7)


<a id="org4182507"></a>

# Don't throw out your old computer just yet!

As MS Windows 10 is no longer supported, its users are being pressured into upgrading.
But in many cases, it may be that your computer (laptop or desktop) is not suited for running Windows 11.
For example, the computer might not have sufficient RAM memory. Or it may not satisfy whatever funny new hardware requirements that
M$ invents.

What many people don't know is, that it is relatively easy to install a Linux-based system, which in many cases will run absolutely fine.
Check out the Lubuntu Linux system. This system is specially adapted to run well on systems with lower-than-average hardware specs.

Whereas Windows 11 will hardly run in any meaningful way on e.g. a laptop with 4GB RAM, the Lubuntu desktop typically will run great.

Furthermore, Lubuntu (just as any Linux system) is freely available at no cost.

Lubuntu has been around since about 2009, its manual (see link below) is extremely well written and detailed, so that most people - tech savvy or not - will be
able to install it.

[Lubuntu Manual](https://manual.lubuntu.me/lts/)

[Lubuntu on Wikipedia](https://en.wikipedia.org/wiki/Lubuntu)


<a id="orgde35f09"></a>

# Replace Microsoft Office with LibreOffice

Unless your usage of MS Office is really complex - using esoteric functionality and/or integrating with other special-purpose software -
switching to LibreOffice should be easy enough. LibreOffice runs on all mainstream operating systems, and then some.

[LibreOffice](https://www.libreoffice.org/)

[LibreOffice on Wikipedia](https://en.wikipedia.org/wiki/LibreOffice)


<a id="orgfafb7a7"></a>

# Other Resources

This is a list of resources that might help to get information.

<https://isitamerican.eu/>
Based on an AI backend, this allows us to check given names of brands/companies for "american-ness".
It may not be 100% reliable, so always be critical and verify things by other sources.

<https://european-alternatives.eu/>
This is a listing of european alternatives in categories of IT.

